In [242]:
import boto3
import pandas as pd
import io

In [243]:
s3 = boto3.client("s3")

bucket_name = "data-504-final-project"
file_key = "Talent_Combined/combined_applicants_details.csv"

obj = s3.get_object(Bucket= bucket_name, Key=file_key)
df = pd.read_csv(obj["Body"])
print(df)

       id               name  gender         dob                        email  \
0       1     Esme Trusslove  Female  04/08/1994        etrusslove0@google.es
1       2    Matthaeus Audas    Male         NaN         maudas1@mapquest.com
2       3    Cherey Tollfree  Female  08/12/1992      ctollfree2@netvibes.com
3       4        Eryn Speers  Female         NaN       espeers3@shinystat.com
4       5  Theadora Berkelay  Female  03/11/1995       tberkelay4@godaddy.com
...   ...                ...     ...         ...                          ...
4686  416    Clyve Gillhespy    Male  15/12/1995    cgillhespybj@buzzfeed.com
4687  417    Vaclav Pietesch    Male  09/11/1994          vpieteschbk@mac.com
4688  418        Kassi Lucio  Female  24/04/1994           kluciobl@exblog.jp
4689  419     Vivianna Letty  Female         NaN       vlettybm@google.com.hk
4690  420      Mercie Groger  Female  10/05/1997  mgrogerbn@timesonline.co.uk

            city               address postcode        phone_number  \
0        Swindon  22056 Lerdahl Avenue      SN1    +44-295-783-0228
1       Charlton      263 Nelson Trail     OX12    +44-957-728-0155
2         Weston      69 Coleman Court     GU32    +44-588-749-6002
3         Sutton    0166 Daystar Drive     CT15    +44 148 787 0613
4          Upton   6 Mandrake Crossing      WF9  +44 (841) 468-3619
...          ...                   ...      ...                 ...
4686  Birmingham        33 Almo Avenue      B40    +44-904-343-2218
4687    Whitwell  6476 Hoffman Terrace     DL10    +44 455 631 6125
4688   Normanton      06 Fulton Center     LE15    +44-834-342-9323
4689   Sheffield      78314 Fisk Plaza       S1    +44-534-758-3140
4690    Charlton        5 Toban Circle     OX12    +44-662-239-4688

                                                    uni degree  invited_date  \
0     Saint George's Hospital Medical School, Univer...    2:1          10.0
1                                      Keele University    2:1          30.0
2           King's College London, University of London    2:1          25.0
3                               University of Edinburgh    2:1           NaN
4                               University of Leicester    2:1           2.0
...                                                 ...    ...           ...
4686                            University of Liverpool    2:1          26.0
4687                        Sheffield Hallam University    2:2          12.0
4688                           University of Buckingham    2:1           3.0
4689                      Leeds Metropolitan University    1st          19.0
4690                             ifs University College    3rd          12.0

           month       invited_by
0     April 2019  Bruno Bellbrook
1     April 2019   Doris Bellasis
2     April 2019    Gismo Tilling
3            NaN              NaN
4     April 2019     Stacey Broad
...          ...              ...
4686   SEPT 2019  Bruno Bellbrook
4687   SEPT 2019     Stacey Broad
4688   SEPT 2019        Fifi Eton
4689   SEPT 2019  Bruno Bellbrook
4690   SEPT 2019    Rupert Ripple

[4691 rows x 14 columns]

In [244]:
print(df.head(10))

   id               name  gender         dob                     email  \
0   1     Esme Trusslove  Female  04/08/1994     etrusslove0@google.es
1   2    Matthaeus Audas    Male         NaN      maudas1@mapquest.com
2   3    Cherey Tollfree  Female  08/12/1992   ctollfree2@netvibes.com
3   4        Eryn Speers  Female         NaN    espeers3@shinystat.com
4   5  Theadora Berkelay  Female  03/11/1995    tberkelay4@godaddy.com
5   6      Kassi Pinnock  Female  19/04/1990      kpinnock5@apache.org
6   7     Austina Depper  Female  22/11/1992         adepper6@java.com
7   8        Rivi Epinay  Female  12/02/1992     repinay7@blogspot.com
8   9       Lay Trosdall    Male  05/07/1991  ltrosdall8@imageshack.us
9  10    Barbabra Mandal  Female  15/06/1991   bmandal9@craigslist.org

         city               address postcode        phone_number  \
0     Swindon  22056 Lerdahl Avenue      SN1    +44-295-783-0228
1    Charlton      263 Nelson Trail     OX12    +44-957-728-0155
2      Weston      69 Coleman Court     GU32    +44-588-749-6002
3      Sutton    0166 Daystar Drive     CT15    +44 148 787 0613
4       Upton   6 Mandrake Crossing      WF9  +44 (841) 468-3619
5  Birmingham   27 Monument Terrace      B12  +44 (897) 978-7574
6      Thorpe    379 Mifflin Circle     BD23    +44 918 348 8810
7  Church End    1566 Thierer Point      CB4    +44-674-101-0656
8    West End      63 Maywood Place     DN36    +44-572-951-7038
9  Whitchurch      45 Clemons Court     BS14  +44 (723) 247-1004

                                                 uni degree  invited_date  \
0  Saint George's Hospital Medical School, Univer...    2:1          10.0
1                                   Keele University    2:1          30.0
2        King's College London, University of London    2:1          25.0
3                            University of Edinburgh    2:1           NaN
4                            University of Leicester    2:1           2.0
5                  The American University in London    1st          18.0
6                               University of Oxford    3rd           2.0
7                         Trinity College Carmarthen    1st          17.0
8                                                NaN    NaN          16.0
9                                                NaN    NaN          23.0

        month       invited_by
0  April 2019  Bruno Bellbrook
1  April 2019   Doris Bellasis
2  April 2019    Gismo Tilling
3         NaN              NaN
4  April 2019     Stacey Broad
5  April 2019    Gismo Tilling
6  April 2019     Stacey Broad
7  April 2019        Fifi Eton
8  April 2019  Bruno Bellbrook
9  April 2019    Gismo Tilling

In [245]:
print(df.tail(10))

       id              name  gender         dob                        email  \
4681  411     Arman Boribal    Male  07/05/1999   aboribalbe@hugedomains.com
4682  412      Rip Jordeson    Male  16/02/1994   rjordesonbf@privacy.gov.au
4683  413   Vernon Bennough    Male  13/05/1996                          NaN
4684  414  Monty Gorriessen    Male  24/03/1995                          NaN
4685  415   Darill Whapples    Male  10/01/1999     dwhapplesbi@hubpages.com
4686  416   Clyve Gillhespy    Male  15/12/1995    cgillhespybj@buzzfeed.com
4687  417   Vaclav Pietesch    Male  09/11/1994          vpieteschbk@mac.com
4688  418       Kassi Lucio  Female  24/04/1994           kluciobl@exblog.jp
4689  419    Vivianna Letty  Female         NaN       vlettybm@google.com.hk
4690  420     Mercie Groger  Female  10/05/1997  mgrogerbn@timesonline.co.uk

            city                  address postcode      phone_number  \
4681      Sutton        018 Annamark Hill      RH5               NaN
4682  Church End        87332 Carey Plaza       N3  +44-146-984-9004
4683     Swindon  6670 Eggendart Junction      SN1  +44 655 174 5869
4684      Weston     92595 Old Shore Road     GU32  +44 681 641 4060
4685   Liverpool           36 Cody Street      L33  +44 412 578 3310
4686  Birmingham           33 Almo Avenue      B40  +44-904-343-2218
4687    Whitwell     6476 Hoffman Terrace     DL10  +44 455 631 6125
4688   Normanton         06 Fulton Center     LE15  +44-834-342-9323
4689   Sheffield         78314 Fisk Plaza       S1  +44-534-758-3140
4690    Charlton           5 Toban Circle     OX12  +44-662-239-4688

                                            uni degree  invited_date  \
4681                 Trinity College Carmarthen    1st           4.0
4682    University of Wales College of Medicine    2:2          25.0
4683                    University of Cambridge    2:1          24.0
4684  International Colleges of Islamic Science    2:1          12.0
4685     Birkbeck College, University of London    1st          19.0
4686                    University of Liverpool    2:1          26.0
4687                Sheffield Hallam University    2:2          12.0
4688                   University of Buckingham    2:1           3.0
4689              Leeds Metropolitan University    1st          19.0
4690                     ifs University College    3rd          12.0

          month        invited_by
4681  SEPT 2019     Rupert Ripple
4682  SEPT 2019     Rupert Ripple
4683  SEPT 2019        Fifi Etton
4684  SEPT 2019        Fifi Etton
4685  SEPT 2019  Sunny Sladefield
4686  SEPT 2019   Bruno Bellbrook
4687  SEPT 2019      Stacey Broad
4688  SEPT 2019         Fifi Eton
4689  SEPT 2019   Bruno Bellbrook
4690  SEPT 2019     Rupert Ripple

In [246]:
print(df.dtypes)

id                int64
name             object
gender           object
dob              object
email            object
city             object
address          object
postcode         object
phone_number     object
uni              object
degree           object
invited_date    float64
month            object
invited_by       object
dtype: object

In [247]:
df['id'].duplicated().any()

np.True_

In [248]:
df['id'].duplicated().sum()

np.int64(4229)

In [249]:
df.duplicated().any()

np.False_

In [250]:
df[df['id'].duplicated(keep=False)]

,id,name,gender,dob,email,city,address,postcode,phone_number,uni,degree,invited_date,month,invited_by
0,1,Esme Trusslove,Female,04/08/1994,etrusslove0@google.es,Swindon,22056 Lerdahl Avenue,SN1,+44-295-783-0228,"Saint George's Hospital Medical School, Univer...",2:1,10.0,April 2019,Bruno Bellbrook
1,2,Matthaeus Audas,Male,NaN,maudas1@mapquest.com,Charlton,263 Nelson Trail,OX12,+44-957-728-0155,Keele University,2:1,30.0,April 2019,Doris Bellasis
2,3,Cherey Tollfree,Female,08/12/1992,ctollfree2@netvibes.com,Weston,69 Coleman Court,GU32,+44-588-749-6002,"King's College London, University of London",2:1,25.0,April 2019,Gismo Tilling
3,4,Eryn Speers,Female,NaN,espeers3@shinystat.com,Sutton,0166 Daystar Drive,CT15,+44 148 787 0613,University of Edinburgh,2:1,NaN,NaN,NaN
4,5,Theadora Berkelay,Female,03/11/1995,tberkelay4@godaddy.com,Upton,6 Mandrake Crossing,WF9,+44 (841) 468-3619,University of Leicester,2:1,2.0,April 2019,Stacey Broad
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4686,416,Clyve Gillhespy,Male,15/12/1995,cgillhespybj@buzzfeed.com,Birmingham,33 Almo Avenue,B40,+44-904-343-2218,University of Liverpool,2:1,26.0,SEPT 2019,Bruno Bellbrook
4687,417,Vaclav Pietesch,Male,09/11/1994,vpieteschbk@mac.com,Whitwell,6476 Hoffman Terrace,DL10,+44 455 631 6125,Sheffield Hallam University,2:2,12.0,SEPT 2019,Stacey Broad
4688,418,Kassi Lucio,Female,24/04/1994,kluciobl@exblog.jp,Normanton,06 Fulton Center,LE15,+44-834-342-9323,University of Buckingham,2:1,3.0,SEPT 2019,Fifi Eton
4689,419,Vivianna Letty,Female,NaN,vlettybm@google.com.hk,Sheffield,78314 Fisk Plaza,S1,+44-534-758-3140,Leeds Metropolitan University,1st,19.0,SEPT 2019,Bruno Bellbrook
4690,420,Mercie Groger,Female,10/05/1997,mgrogerbn@timesonline.co.uk,Charlton,5 Toban Circle,OX12,+44-662-239-4688,ifs University College,3rd,12.0,SEPT 2019,Rupert Ripple

In [251]:
# how many unique ids appear more than once
counts = df.groupby('id').size().rename('rows_per_id')
print("IDs with >1 row:", (counts > 1).sum())

IDs with >1 row: 453

In [252]:
df['id'] = range(1, len(df) + 1)

In [253]:
print(df.columns)

Index(['id', 'name', 'gender', 'dob', 'email', 'city', 'address', 'postcode',
       'phone_number', 'uni', 'degree', 'invited_date', 'month', 'invited_by'],
      dtype='object')

In [254]:
# name format
df['name'] = df['name'].str.title()

In [255]:
print((df['name']).head(5))

0       Esme Trusslove
1      Matthaeus Audas
2      Cherey Tollfree
3          Eryn Speers
4    Theadora Berkelay
Name: name, dtype: object

In [256]:
# dob format
df['dob'] = pd.to_datetime(df['dob'], errors='coerce', dayfirst=True)

In [257]:
print(df['dob'])

0      1994-08-04
1             NaT
2      1992-12-08
3             NaT
4      1995-11-03
          ...
4686   1995-12-15
4687   1994-11-09
4688   1994-04-24
4689          NaT
4690   1997-05-10
Name: dob, Length: 4691, dtype: datetime64[ns]

In [258]:
# phone number format
df['phone_number'] = (
    df['phone_number']
      .str.replace(r"[ \-\(\)]", "", regex=True)  # remove unwanted chars
      .str.replace(r"^\+?44", "+44", regex=True) # normalize prefix to +44
)

In [259]:
print((df['phone_number']).head(20))

0     +442957830228
1     +449577280155
2     +445887496002
3     +441487870613
4     +448414683619
5     +448979787574
6     +449183488810
7     +446741010656
8     +445729517038
9     +447232471004
10    +442314869365
11              NaN
12    +445498657923
13    +448479792004
14    +444868433503
15    +448139571832
16    +445029375738
17    +442203184847
18    +446305506247
19    +447902161380
Name: phone_number, dtype: object

In [260]:
# format degree
mapping = {
    '1st': '1:1',
    '3rd': '3:0'
}

# standardize degree column
df['degree'] = df['degree'].str.strip().replace(mapping)

In [261]:
print((df['degree']).head(10))

0    2:1
1    2:1
2    2:1
3    2:1
4    2:1
5    1:1
6    3:0
7    1:1
8    NaN
9    NaN
Name: degree, dtype: object

In [262]:
# Create a mask, find rows that are not nan
valid_mask = df['invited_date'].notna() & df['month'].notna()

# Conversion only to valid rows
df['invited_date'] = df.apply(
    lambda row: pd.to_datetime(
        f"{int(row['invited_date'])} {row['month']}", 
        format='%d %B %Y',
        errors='coerce'
    ) if pd.notna(row['invited_date']) and pd.notna(row['month']) else pd.NaT,
    axis=1
)

In [263]:
df = df.drop(columns=['month'])

In [264]:
print(df.head(10))
print(df.dtypes)

   id               name  gender        dob                     email  \
0   1     Esme Trusslove  Female 1994-08-04     etrusslove0@google.es
1   2    Matthaeus Audas    Male        NaT      maudas1@mapquest.com
2   3    Cherey Tollfree  Female 1992-12-08   ctollfree2@netvibes.com
3   4        Eryn Speers  Female        NaT    espeers3@shinystat.com
4   5  Theadora Berkelay  Female 1995-11-03    tberkelay4@godaddy.com
5   6      Kassi Pinnock  Female 1990-04-19      kpinnock5@apache.org
6   7     Austina Depper  Female 1992-11-22         adepper6@java.com
7   8        Rivi Epinay  Female 1992-02-12     repinay7@blogspot.com
8   9       Lay Trosdall    Male 1991-07-05  ltrosdall8@imageshack.us
9  10    Barbabra Mandal  Female 1991-06-15   bmandal9@craigslist.org

         city               address postcode   phone_number  \
0     Swindon  22056 Lerdahl Avenue      SN1  +442957830228
1    Charlton      263 Nelson Trail     OX12  +449577280155
2      Weston      69 Coleman Court     GU32  +445887496002
3      Sutton    0166 Daystar Drive     CT15  +441487870613
4       Upton   6 Mandrake Crossing      WF9  +448414683619
5  Birmingham   27 Monument Terrace      B12  +448979787574
6      Thorpe    379 Mifflin Circle     BD23  +449183488810
7  Church End    1566 Thierer Point      CB4  +446741010656
8    West End      63 Maywood Place     DN36  +445729517038
9  Whitchurch      45 Clemons Court     BS14  +447232471004

                                                 uni degree invited_date  \
0  Saint George's Hospital Medical School, Univer...    2:1   2019-04-10
1                                   Keele University    2:1   2019-04-30
2        King's College London, University of London    2:1   2019-04-25
3                            University of Edinburgh    2:1          NaT
4                            University of Leicester    2:1   2019-04-02
5                  The American University in London    1:1   2019-04-18
6                               University of Oxford    3:0   2019-04-02
7                         Trinity College Carmarthen    1:1   2019-04-17
8                                                NaN    NaN   2019-04-16
9                                                NaN    NaN   2019-04-23

        invited_by
0  Bruno Bellbrook
1   Doris Bellasis
2    Gismo Tilling
3              NaN
4     Stacey Broad
5    Gismo Tilling
6     Stacey Broad
7        Fifi Eton
8  Bruno Bellbrook
9    Gismo Tilling
id                       int64
name                    object
gender                  object
dob             datetime64[ns]
email                   object
city                    object
address                 object
postcode                object
phone_number            object
uni                     object
degree                  object
invited_date    datetime64[ns]
invited_by              object
dtype: object

In [265]:
print((df['invited_date']).head(10))

0   2019-04-10
1   2019-04-30
2   2019-04-25
3          NaT
4   2019-04-02
5   2019-04-18
6   2019-04-02
7   2019-04-17
8   2019-04-16
9   2019-04-23
Name: invited_date, dtype: datetime64[ns]